package basealgorithms;

/**
 * @author kukvly
 * 
 * 삼각형
 * NxM 의 직사각형이 있고, 1x1 크기의 단위 정사각형으로 나누어져 있다.
 * 각각의 정사각형 중심에는 점이 한 개 찍혀있고, 색은 빨강, 초록, 파랑중의 하나다.
 * 서로 다른 세 개의 점을 선택해보자. 선택한 세 점은 일직선 상에 있어도 된다.
 * 그리고 세 점을 서로 연결한다. 그럼 삼각형을 만들 수 있다. (일직선도 삼각형이다)
 * 만약 이런 삼각형의 꼭짓점 색이 서로 다르다면 이 삼각형을 아름다운 삼각형이라고 한다.
 * 만약 아름다운 삼각형 A와 아름다운 삼각형 B가 두 개의 꼭짓점이 같고, B의 넓이가 A보다 크다면,
 * 삼각형 A를 커질 수 있는 아름다운 삼각형이라고 한다. (일직선 모양의 삼각형 넓이는 0이다)
 * 
 * 아름다운 삼각형의 개수는?
 * 
 */

public class base9 {
	public static void main(String[] args) {
		
	}
}
